node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "global_step"
    }
  }
}
node {
  name: "global_step/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "AssignVariableOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/VarIsInitializedOp"
  input: "global_step/VarIsInitializedOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/VarIsInitializedOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step/cond/Read/ReadVariableOp/Switch:1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Read/ReadVariableOp/Switch"
  op: "Switch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Identity"
  op: "Identity"
  input: "global_step/cond/Read/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/Identity"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "input_pipeline_task0/normalize_element/component_0"
  op: "Const"
  device: "/job:tpu_worker/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1024
          }
        }
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00000-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00001-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00002-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00003-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00004-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00005-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00006-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00007-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00008-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00009-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00010-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00011-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00012-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00013-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00014-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00015-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00016-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00017-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00018-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00019-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00020-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00021-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00022-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00023-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00024-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00025-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00026-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00027-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00028-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00029-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00030-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00031-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00032-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00033-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00034-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00035-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00036-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00037-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00038-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00039-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00040-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00041-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00042-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00043-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00044-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00045-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00046-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00047-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00048-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00049-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00050-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00051-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00052-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00053-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00054-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00055-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00056-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00057-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00058-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00059-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00060-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00061-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00062-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00063-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00064-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00065-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00066-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00067-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00068-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00069-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00070-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00071-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00072-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00073-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00074-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00075-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00076-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00077-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00078-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00079-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00080-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00081-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00082-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00083-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00084-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00085-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00086-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00087-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00088-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00089-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00090-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00091-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00092-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00093-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00094-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00095-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00096-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00097-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00098-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00099-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00100-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00101-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00102-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00103-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00104-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00105-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00106-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00107-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00108-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00109-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00110-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00111-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00112-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00113-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00114-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00115-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00116-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00117-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00118-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00119-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00120-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00121-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00122-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00123-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00124-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00125-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00126-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00127-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00128-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00129-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00130-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00131-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00132-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00133-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00134-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00135-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00136-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00137-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00138-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00139-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00140-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00141-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00142-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00143-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00144-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00145-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00146-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00147-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00148-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00149-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00150-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00151-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00152-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00153-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00154-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00155-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00156-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00157-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00158-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00159-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00160-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00161-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00162-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00163-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00164-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00165-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00166-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00167-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00168-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00169-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00170-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00171-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00172-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00173-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00174-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00175-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00176-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00177-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00178-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00179-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00180-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00181-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00182-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00183-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00184-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00185-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00186-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00187-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00188-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00189-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00190-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00191-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00192-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00193-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00194-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00195-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00196-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00197-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00198-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00199-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00200-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00201-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00202-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00203-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00204-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00205-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00206-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00207-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00208-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00209-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00210-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00211-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00212-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00213-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00214-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00215-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00216-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00217-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00218-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00219-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00220-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00221-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00222-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00223-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00224-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00225-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00226-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00227-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00228-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00229-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00230-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00231-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00232-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00233-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00234-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00235-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00236-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00237-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00238-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00239-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00240-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00241-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00242-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00243-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00244-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00245-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00246-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00247-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00248-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00249-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00250-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00251-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00252-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00253-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00254-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00255-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00256-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00257-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00258-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00259-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00260-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00261-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00262-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00263-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00264-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00265-of-01024"
        string_val: "/readahead/128M/placer/prod/home/tensorflow-datasets-cns-storage-owner/datasets/imagenet2012/5.0.0/imagenet2012-train.tfrecord-00266-of-01024"
